; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared5 - mode
	infrared0 - mode
	thermograph3 - mode
	infrared2 - mode
	thermograph7 - mode
	spectrograph1 - mode
	infrared6 - mode
	infrared4 - mode
	Star6 - direction
	Star0 - direction
	Star5 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared4)
	(supports instrument1 infrared5)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared6)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph7)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared6)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Phenomenon7 infrared5)
	(have_image Phenomenon7 thermograph7)
	(have_image Planet8 infrared6)
	(have_image Planet8 infrared2)
	(have_image Star9 infrared6)
	(have_image Star9 infrared2)
	(have_image Star10 infrared5)
	(have_image Star10 thermograph3)
	(have_image Star11 infrared2)
	(have_image Star12 thermograph7)
))

)

; plan
1. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 10
3. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 10
4. (turn_to satellite1 star9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star9)
   goals met: 0 of 10
5. (take_image satellite1 star9 instrument4 infrared6)
   added: (have_image star9 infrared6)
   goals met: 1 of 10
6. (turn_to satellite1 planet8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet8)
   goals met: 1 of 10
7. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 1 of 10
8. (take_image satellite1 planet8 instrument4 infrared6)
   added: (have_image planet8 infrared6)
   goals met: 2 of 10
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
10. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 2 of 10
11. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 2 of 10
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 10
13. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 10
14. (take_image satellite0 phenomenon7 instrument1 infrared5)
   added: (have_image phenomenon7 infrared5)
   goals met: 3 of 10
15. (turn_to satellite0 star10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star10)
   goals met: 3 of 10
16. (take_image satellite0 star10 instrument1 infrared5)
   added: (have_image star10 infrared5)
   goals met: 4 of 10
17. (take_image satellite0 star10 instrument1 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 5 of 10
18. (turn_to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 5 of 10
19. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 5 of 10
20. (turn_to satellite1 phenomenon7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 10
21. (take_image satellite1 phenomenon7 instrument3 thermograph7)
   added: (have_image phenomenon7 thermograph7)
   goals met: 6 of 10
22. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 6 of 10
23. (take_image satellite1 planet8 instrument3 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 7 of 10
24. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 7 of 10
25. (take_image satellite1 star11 instrument3 infrared2)
   added: (have_image star11 infrared2)
   goals met: 8 of 10
26. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 8 of 10
27. (take_image satellite1 star12 instrument3 thermograph7)
   added: (have_image star12 thermograph7)
   goals met: 9 of 10
28. (turn_to satellite1 star9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
29. (take_image satellite1 star9 instrument3 infrared2)
   added: (have_image star9 infrared2)
   goals met: 10 of 10
